Revit 2024 API
Mirror.MirrorColorByObject Property
 The property labeled "Color By Object" from the "Mirror" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MirrorColorByObject { get; }
Visual Basic
Public Shared ReadOnly Property MirrorColorByObject As String
	Get
Visual C++
public:
static property String^ MirrorColorByObject {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Mirror Class
Autodesk.Revit.DB.Visual Namespace